Merge pull request #28 from hohoangluan/feature/contract
Chỉnh lại testcase và kiểm thử testcase mới, diagram, chỉnh code dựa …
